Grooming/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
    </items>
    <items>
      <name>Услуги</name>
      <description>Услуги</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Grooming/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>EnumRef.ВидЦены</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Grooming/src/Catalogs/Номенклатура/Forms/ФормаСозданияЦены/Module.bsl
&НаСервере
Процедура ЗаписатьНаСервере()
	НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);	НаборЗаписей.Отбор.ВидЦены.Установить(ВидЦены);	НаборЗаписей.Отбор.Период.Установить(ДатаНачалаДействияЦены);		НаборЗаписей.Прочитать();	Если НаборЗаписей.Количество() Тогда		НаборЗаписей[0].Цена = Цена;	Иначе		НоваяЗаписьЦен = НаборЗаписей.Добавить();		НоваяЗаписьЦен.Номенклатура = Номенклатура;		НоваяЗаписьЦен.ВидЦены = ВидЦены;		НоваяЗаписьЦен.Период = ДатаНачалаДействияЦены;		НоваяЗаписьЦен.Цена = Цена;	КонецЕсли;	НаборЗаписей.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЦенаНаДату = РаботаСЦенамиВызовСервера.ПолучитьЗаписьЦеныНаКонкретнуюДату(Номенклатура, ВидЦены, ДатаНачалаДействияЦены); 	Если ЗначениеЗаполнено(ЦенаНаДату) Тогда       		ТекстВопроса = СтрШаблон("На указанную дату уже имеется введенная цена %1, вы действительно хотите изменить цену?", ЦенаНаДату);		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииЦены", ЭтаФорма);        		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");  	Иначе		ЗаписатьНаСервере(); 		Закрыть();			КонецЕсли;
КонецПроцедуры   

&НаКлиентеПроцедура ПослеОтветаНаВопросОбИзмененииЦены(Результат, ДополнительныеПараметры) Экспорт		Если Результат = КодВозвратаДиалога.Да Тогда		ЗаписатьНаСервере();		Закрыть();	КонецЕсли;	КонецПроцедуры 


&НаСервереПроцедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	ДатаНачалаДействияЦены = НачалоДня(ТекущаяДата());	Номенклатура = Параметры.Номенклатура;КонецПроцедуры
